Tekla.Structures.CatalogInternal.ImportResult
The result of the import function.

Tekla.Structures.CatalogInternal.ImportResult.NoResult
Import failed.

Tekla.Structures.CatalogInternal.ImportResult.Ok
Import succeeded.

Tekla.Structures.CatalogInternal.ImportResult.Fail
Import failed.

Tekla.Structures.CatalogInternal.ImportResult.GeometryError
Geometry fatal error causing importing failed.

Tekla.Structures.CatalogInternal.ImportResult.GeometryFileMissing
The geometry file is missing.

Tekla.Structures.CatalogInternal.ImportResult.NameAlreadyExists
The shape name already exists in the model but overwriting not specified.

Tekla.Structures.CatalogInternal.ImportResult.MetadataError
There is error in metadata.

Tekla.Structures.CatalogInternal.ImportResult.MetadataFileMissing
The metadata file is mandatory but missing.

Tekla.Structures.CatalogInternal.ImportResult.ShapeAlreadyExists
The metadata file is mandatory but missing.